Revit 2026 API

# RebarConstraintIsReferenceValidForConstraint Method

---

Checks if the reference provided can be used in creating Rebar constraints

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsReferenceValidForConstraint(
	Reference targetReference
)
```
```vb
Public Function IsReferenceValidForConstraint (
	targetReference As Reference
) As Boolean
```
```cpp
public:
bool IsReferenceValidForConstraint(
	Reference^ targetReference
)
```
```fsharp
member IsReferenceValidForConstraint :
        targetReference : Reference -> bool
```

#### Parameters

targetReference Reference
     The reference to be checked

#### Return Value

Boolean returns true if reference can be used in a constraint, false otherwise

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Reference is valid if it points to an uncut face of a structural that can host rebar.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace